In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame([(1,2),(3,4),(5,6)], columns=['a','b'])

df1

In [7]:
df1

   a  b
0  1  2
1  3  4
2  5  6

In [9]:
df1.set_index('a', inplace=True)

In [10]:
df1

   b
a
1  2
3  4
5  6

In [11]:
df2 = pd.DataFrame([(2,3),(4,5),(6,7)], columns=['a','b'])

In [12]:
df2.set_index('a', inplace=True)

In [13]:
df2

   b
a
2  3
4  5
6  7

In [14]:
df1.add(df2, fill_value=0)

     b
a
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0

In [15]:
df1+df2

    b
a
1 NaN
2 NaN
3 NaN
4 NaN
5 NaN
6 NaN

In [16]:
df3 = pd.DataFrame([(1,3),(2,5),(3,7)], columns=['a','b'])

In [17]:
df3.set_index('a', inplace=True)

In [18]:
df3

   b
a
1  3
2  5
3  7

In [19]:
df1+df3

      b
a
1   5.0
2   NaN
3  11.0
5   NaN

In [20]:
df4 = pd.DataFrame([(1,2),(2,4),(3,6)], columns=['a','b'])

In [21]:
df4.set_index('a', inplace=True)

In [23]:
df3+df4

    b
a
1   5
2   9
3  13

In [5]:
df1 = pd.DataFrame([(1,1),(2,1),(3,2)], columns=['a','b'])

In [6]:
df1.set_index('a', inplace=True)

In [7]:
df1

   b
a
1  1
2  1
3  2

In [8]:
df1.rename(columns={'b':'sb-1'}, inplace=True)

In [9]:
df1

   sb-1
a
1     1
2     1
3     2

In [10]:
df2 = pd.DataFrame([(1,1),(2,1),(3,2)], columns=['a','sb-2'])

In [11]:
df2.set_index('a', inplace=True)

In [12]:
df2

   sb-2
a
1     1
2     1
3     2

In [22]:
df3 = pd.DataFrame([(1,2),(2,3),(3,2)], columns=['a','sb-3'])

In [23]:
df3.set_index('a', inplace=True)

In [24]:
df3

   sb-3
a
1     2
2     3
3     2

In [25]:
df4 = pd.DataFrame([(1,3),(2,4),(3,2)], columns=['a','sb-4'])

In [26]:
df4.set_index('a', inplace=True)

In [18]:
df4

   sb-4
a
1     3
2     4
3     2

In [27]:
dfs = [df1,df2,df3,df4]

In [28]:
dfs

[   sb-1
 a
 1     1
 2     1
 3     2,    sb-2
 a
 1     1
 2     1
 3     2,    sb-3
 a
 1     2
 2     3
 3     2,    sb-4
 a
 1     3
 2     4
 3     2]

In [29]:
dfs[0].join(dfs[1:])

   sb-1  sb-2  sb-3  sb-4
a
1     1     1     2     3
2     1     1     3     4
3     2     2     2     2

In [30]:
dfss = [df1]

In [31]:
dfss[0].join(dfss[1:])

   sb-1
a
1     1
2     1
3     2

In [32]:
dfsss = []

In [33]:
dfsss[0].join(dfsss[1:])

IndexError: list index out of range

In [5]:
import pandas as pd
raw_data = {'id':[1,2,3,4,5,6,7,8,9,10], 'value':[0.34,1.44,3,-9999,-9999,3.5,0.54,0.0343,-9999,0.0]}

In [6]:
df = pd.DataFrame(raw_data)
df.head()

   id    value
0   1     0.34
1   2     1.44
2   3     3.00
3   4 -9999.00
4   5 -9999.00

In [7]:
df['value']

0       0.3400
1       1.4400
2       3.0000
3   -9999.0000
4   -9999.0000
5       3.5000
6       0.5400
7       0.0343
8   -9999.0000
9       0.0000
Name: value, dtype: float64

In [14]:
df['value'][df['value'] == -9999].count()

3

In [15]:
len(df.index)

10